Ran Plan for dir: `virtual-machine/env/dev/jumphost` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.jumphost.proxmox_virtual_environment_vm.vm: Refreshing state... [id=100]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.jumphost.proxmox_virtual_environment_vm.vm must be replaced
-/+ resource "proxmox_virtual_environment_vm" "vm" {
      + description             = "jumhost machine"
      ~ id                      = "100" -> (known after apply)
      ~ ipv4_addresses          = [] -> (known after apply)
      ~ ipv6_addresses          = [] -> (known after apply)
      + keyboard_layout         = "en-us"
      ~ mac_addresses           = [
          - "BC:24:11:D8:6E:D6",
        ] -> (known after apply)
      + migrate                 = false
        name                    = "jumphost"
      ~ network_interface_names = [] -> (known after apply)
      + on_boot                 = true
      + reboot                  = false
      ~ scsi_hardware           = "virtio-scsi-single" -> "virtio-scsi-pci"
      + stop_on_destroy         = true
      ~ tags                    = [
          + "vm",
          + "ubuntu",
          + "jumphost",
        ]
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
        # (10 unchanged attributes hidden)

      + agent {
          + enabled = false
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      ~ cpu {
          - flags        = [] -> null
          ~ type         = "x86-64-v2-AES" -> "host"
            # (8 unchanged attributes hidden)
        }

      ~ disk {
          ~ cache             = "none" -> "writethrough"
          ~ discard           = "ignore" -> "on"
          ~ path_in_datastore = "vm-100-disk-0" -> (known after apply)
          ~ ssd               = false -> true
            # (10 unchanged attributes hidden)
        }

      + initialization {
          + datastore_id = "local-lvm"
          + upgrade      = (known after apply)

          + ip_config {
              + ipv4 {
                  + address = "192.168.43.98/24"
                  + gateway = "192.168.43.254"
                }
            }
        }

      ~ network_device {
          - disconnected = false -> null
          ~ firewall     = true -> false
          ~ mac_address  = "BC:24:11:D8:6E:D6" -> (known after apply)
            # (8 unchanged attributes hidden)
        }

      + serial_device {
          + device = "socket"
        }

      + startup {
          + down_delay = 60
          + order      = 3
          + up_delay   = 60
        }

      + tpm_state { # forces replacement
          + datastore_id = "local-lvm"
          + version      = "v2.0" # forces replacement
        }

      - vga {
          - memory    = 0 -> null
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d virtual-machine/env/dev/jumphost
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.abdullahainun.site/lock?id=abdullahainun%252Fhomelab-tf-proxmox%252Fvirtual-machine%252Fenv%252Fdev%252Fjumphost%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d virtual-machine/env/dev/jumphost
  ```
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```